In [1]:
import pandas as pd
col_names=['sl_no','age','gender','role','id']
data=pd.read_table("/home/ila/PycharmProjects/pythonworks/artificialintelligence/pandas/files/ex.txt",sep="|",names=col_names)
data.columns

/home/ila/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: read_table is deprecated, use read_csv instead.
  This is separate from the ipykernel package so we can avoid doing imports until

Index(['sl_no', 'age', 'gender', 'role', 'id'], dtype='object')

In [2]:
data.head()

   sl_no  age gender        role     id
0      1   24      M  technician  85711
1      2   53      F       other  94043
2      3   23      M      writer  32067
3      4   24      M  technician  43537
4      5   33      F       other  15213

In [3]:
data.drop('id', axis=1, inplace=True)
data.columns

Index(['sl_no', 'age', 'gender', 'role'], dtype='object')

In [6]:
data.drop(2,axis=0, inplace=True)
data.head()

   sl_no  age gender        role
0      1   24      M  technician
1      2   53      F       other
3      4   24      M  technician
4      5   33      F       other
5      6   42      M   executive

In [7]:
data.drop([4,5,6],axis=0)
data.head()

   sl_no  age gender        role
0      1   24      M  technician
1      2   53      F       other
3      4   24      M  technician
4      5   33      F       other
5      6   42      M   executive

In [8]:
data.mean()

sl_no    472.497877
age       34.063694
dtype: float64

In [9]:
data.mean(axis=0)

sl_no    472.497877
age       34.063694
dtype: float64

In [10]:
data.mean(axis=1)

0       12.5
1       27.5
3       14.0
4       19.0
5       24.0
6       32.0
7       22.0
8       19.0
9       31.5
10      25.0
11      20.0
12      30.0
13      29.5
14      32.0
15      18.5
16      23.5
17      26.5
18      29.5
19      31.0
20      23.5
21      23.5
22      26.5
23      22.5
24      32.0
25      37.5
26      33.5
27      30.0
28      35.0
29      18.5
30      27.5
       ...
913    479.0
914    482.5
915    471.5
916    469.5
917    479.0
918    472.0
919    475.0
920    470.5
921    475.5
922    472.0
923    476.5
924    471.5
925    487.5
926    475.0
927    474.5
928    486.5
929    479.0
930    495.5
931    495.0
932    480.5
933    497.5
934    488.5
935    480.0
936    492.5
937    488.0
938    482.5
939    486.0
940    480.5
941    495.0
942    482.5
Length: 942, dtype: float64

In [11]:
data.mean(axis=1).shape

(942,)